tap "nikitabobko/tap"
brew "awscli"
brew "libpng"
brew "chezmoi"
brew "code2prompt"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "luarocks"
brew "mactop"
brew "mas"
brew "mise"
brew "tree-sitter"
brew "neovim"
brew "picocom"
brew "pkgconf"
brew "poppler"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "sheldon"
brew "starship"
brew "tmux"
brew "tree-sitter-cli"
brew "wget"
brew "yazi"
brew "zoxide"
cask "claude-code"
cask "docker-desktop"
cask "figma"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "notion"
cask "raycast"
cask "slack"
cask "temurin"
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
