# =============================================================================
# Homebrew Bundle File (Brewfile)
# Manage packages declaratively with `brew bundle`
# =============================================================================

# Taps (Third-party repositories)
tap "nikitabobko/tap"

# GUI Applications (Casks)
cask "google-chrome"
cask "notion"
cask "discord"
cask "zoom"
cask "slack"
cask "figma"
cask "intellij-idea-ce"
cask "postico"
cask "postman"
cask "claude-code"
cask "ghostty"
cask "raycast"
cask "nikitabobko/tap/aerospace"

# Command Line Tools (Formulae)
brew "git"
brew "gh"
brew "fzf"
brew "zoxide"
brew "starship"
brew "sheldon"
brew "mise"
brew "neovim"
brew "mactop"
brew "mas"
brew "eza"
brew "chezmoi"
brew "jq"
brew "ripgrep"
brew "yazi"
brew "fd"
brew "ffmpeg"
brew "sevenzip"
brew "poppler"
brew "resvg"
brew "imagemagick"
cask "font-symbols-only-nerd-font"